'''
Вільний діалог

Вільне завдання: вигадайте свою програму, яка задає питання і коментує відповіді.
Можна, наприклад, написати програму-анкету, яка запитує дані людини: ім'я, прізвище, вік, улюблені колір 
і страву і т. д., а потім друкує табличку типу 
"Ім'я: (ім'я людини)". 
"Прізвище: (введене прізвище)" 
і т. д.            
                                                                                  
А можна придумати смішний діалог. 
Запропонуйте друзям поговорити з цією програмою!
'''
print("Привіт! Я тут, щоб трошки поспілкуватися. Давайте розпочнемо!")
a = input("Як вас звати? ")
print(f"Привіт, {a}! Яке ваше улюблене хобі? ")
b = input()
print(f"Цікаво! {b} - це чудовий спосіб провести час.")
print("А як ви оцінюєте свій день на 10-бальній шкалі? ")
r = input()
if int(r) >= 7:
    print("Це чудово! Надіюсь, що ваш день ще краще стане.")
else:
    print("Не хвилюйтеся, завтра буде краще!")
print("Дякую за цей короткий діалог, гарного дня!")
